[RM_Mark X2AbilityTemplate]
LocFriendlyName="Mark Target"
LocLongDescription="Hybrids can Mark a target using the Avenger's computer systems and their modified chips, giving aim assistance to other XCOM soldiers. Has a squadwide cooldown due to the strain on the Avenger's systems."
LocHelpText="Mark an enemy target. Allies gain +<Ability:MARKTARGETAIMBONUS/> Aim when attacking the target. Lasts for <Ability:MARK_COOLDOWN/> turn(s), has a squadwide cooldown of <Ability:MARK_TURNS/> turn(s)."

[HybridRookie X2SoldierClassTemplate]
DisplayName="Hybrid Rookie"

[RM_HybridSoldier X2CharacterTemplate]
strCharacterName="Soldier"

strCharacterBackgroundMale[0]="<XGParam:StrValue1/!FirstName/> knows little of his birth and retains only hazy, broken memories of his time spent in service to ADVENT. Now free and guided by his fellow Skirmishers, he has found purpose in their drive to overthrow the Elders."
strCharacterBackgroundMale[1]="Among the most recent Skirmishers freed from ADVENT's control, <XGParam:StrValue1/!FirstName/> still suffers from the pains associated with the removal of his chip.  The ritual scarification his people immediately applied to the extraction site only exacerbates the issue."
strCharacterBackgroundMale[2]="Originally stationed at a remote ADVENT outpost, <XGParam:StrValue1/!FirstName/> was left for dead by his masters after being wounded in the field. When he awoke his control chip had malfunctioned, leaving him free of the Elders' commands but alone and gravely wounded."
strCharacterBackgroundMale[3]="Freed from the Elders' grasp by Betos herself, <XGParam:StrValue1/!FirstName/> is among the most loyal and fearsome of the Skirmisher warriors. He is driven to ensure that the Elders learn his name, the name they never intended him to have."
strCharacterBackgroundMale[4]="Much like Mox himself, <XGParam:StrValue1/!FirstName/> is known to the human factions for crimes he committed in the Elders name while still under their control. Although most would not hold them accountable, just as with Mox, <XGParam:StrValue1/!FirstName/> is intent on atoning for these mistakes regardless."

strCharacterBackgroundFemale[0]="<XGParam:StrValue1/!FirstName/> knows little of her birth and retains only hazy, broken memories of her time spent in service to ADVENT. Now free and guided by her fellow Skirmishers, she has found purpose in their drive to overthrow the Elders."
strCharacterBackgroundFemale[1]="Among the most recent Skirmishers freed from ADVENT's control, <XGParam:StrValue1/!FirstName/> still suffers from the pains associated with the removal of her chip.  The ritual scarification her people immediately applied to the extraction site only exacerbates the issue."
strCharacterBackgroundFemale[2]="Originally stationed at a remote ADVENT outpost, <XGParam:StrValue1/!FirstName/> was left for dead by her masters after being wounded in the field. When she awoke her control chip had malfunctioned, leaving her free of the Elders' commands but alone and gravely wounded."
strCharacterBackgroundFemale[3]="Freed from the Elders' grasp by Betos herself, <XGParam:StrValue1/!FirstName/> is among the most loyal and fearsome of the Skirmisher warriors. She is driven to ensure that the Elders learn her name, the name they never intended her to have." 
strCharacterBackgroundFemale[4]="Much like Mox himself, <XGParam:StrValue1/!FirstName/> is known to the human factions for crimes she committed in the Elders name while still under their control. Although most would not hold them accountable, just as with Mox, <XGParam:StrValue1/!FirstName/> is intent on atoning for these mistakes regardless." 

[Reward_HybridSoldier X2RewardTemplate]
DisplayName="ADVENT Hybrid Soldier"

[CovertActionNarrative_RecruitHybridSoldier_Skirmishers X2CovertActionNarrativeTemplate]
ActionName="Special Recruit"
ActionPreNarrative="The Skirmishers are always willing to help an ally in need, if it does not interfere with our own efforts. Let us speak of further cooperation together."
ActionPostNarrative="They may not have joined the Skirmisher Corp proper, but I am certain they will be of help to you, Commander."

[CovertAction_RecruitHybridSoldier X2CovertActionTemplate]
ActionObjective="Recruit Hybrid"


[HybridMale_A_Afr X2BodyPartTemplate]
DisplayName="Face A"
[HybridMale_A_Asn X2BodyPartTemplate]
DisplayName="Face A"
[HybridMale_A_Cauc X2BodyPartTemplate]
DisplayName="Face A"
[HybridMale_A_Lat X2BodyPartTemplate]
DisplayName="Face A"

[HybridFem_A_Afr X2BodyPartTemplate]
DisplayName="Face A"
[HybridFem_A_Asn X2BodyPartTemplate]
DisplayName="Face A"
[HybridFem_A_Cauc X2BodyPartTemplate]
DisplayName="Face A"
[HybridFem_A_Lat X2BodyPartTemplate]
DisplayName="Face A"

[HybridMaleVoice1_Localized X2BodyPartTemplate]
DisplayName="Hybrid 1"
[HybridMaleVoice2_Localized X2BodyPartTemplate]
DisplayName="Hybrid 2"

[HybridFemaleVoice1_Localized X2BodyPartTemplate]
DisplayName="Hybrid 1"
[HybridFemaleVoice2_Localized X2BodyPartTemplate]
DisplayName="Hybrid 2"

[Hybrid_Scar_A X2BodyPartTemplate]
DisplayName="Hemisphere"
[Hybrid_Scar_B X2BodyPartTemplate]
DisplayName="Chevron"
[Hybrid_Scar_C X2BodyPartTemplate]
DisplayName="Center Point"
[Hybrid_Scar_D X2BodyPartTemplate]
DisplayName="Crown"
[Hybrid_Scar_E X2BodyPartTemplate]
DisplayName="Ritual"
